MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J50/mcu.h
// Register: PMDIN2H
#define PMDIN2H PMDIN2H
extern volatile unsigned char           PMDIN2H             __at(0xF45);
#ifndef _LIB_BUILD
asm("PMDIN2H equ 0F45h");
#endif

// Register: PMDOUT2
#define PMDOUT2 PMDOUT2
extern volatile unsigned short          PMDOUT2             __at(0xF46);
#ifndef _LIB_BUILD
asm("PMDOUT2 equ 0F46h");
#endif

// Register: PMDOUT2L
#define PMDOUT2L PMDOUT2L
extern volatile unsigned char           PMDOUT2L            __at(0xF46);
#ifndef _LIB_BUILD
asm("PMDOUT2L equ 0F46h");
#endif

// Register: PMDOUT2H
#define PMDOUT2H PMDOUT2H
extern volatile unsigned char           PMDOUT2H            __at(0xF47);
#ifndef _LIB_BUILD
asm("PMDOUT2H equ 0F47h");
#endif

// Register: PMMODE
#define PMMODE PMMODE
extern volatile unsigned short          PMMODE              __at(0xF48);
#ifndef _LIB_BUILD
asm("PMMODE equ 0F48h");
#endif

// Register: PMMODEL
#define PMMODEL PMMODEL
extern volatile unsigned char           PMMODEL             __at(0xF48);
#ifndef _LIB_BUILD
asm("PMMODEL equ 0F48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WAITE                  :2;
        unsigned WAITM                  :4;
        unsigned WAITB                  :2;
    };
    struct {
        unsigned WAITE0                 :1;
        unsigned WAITE1                 :1;
        unsigned WAITM0                 :1;
        unsigned WAITM1                 :1;
        unsigned WAITM2                 :1;
        unsigned WAITM3                 :1;
        unsigned WAITB0                 :1;
        unsigned WAITB1                 :1;
    };
} PMMODELbits_t;
extern volatile PMMODELbits_t PMMODELbits __at(0xF48);
// bitfield macros
#define _PMMODEL_WAITE_POSN                                 0x0
#define _PMMODEL_WAITE_POSITION                             0x0
#define _PMMODEL_WAITE_SIZE                                 0x2
#define _PMMODEL_WAITE_LENGTH                               0x2
#define _PMMODEL_WAITE_MASK                                 0x3
#define _PMMODEL_WAITM_POSN                                 0x2
#define _PMMODEL_WAITM_POSITION                             0x2
#define _PMMODEL_WAITM_SIZE                                 0x4
#define _PMMODEL_WAITM_LENGTH                               0x4
#define _PMMODEL_WAITM_MASK                                 0x3C
#define _PMMODEL_WAITB_POSN                                 0x6
#define _PMMODEL_WAITB_POSITION                             0x6
#define _PMMODEL_WAITB_SIZE                                 0x2
#define _PMMODEL_WAITB_LENGTH                               0x2
#define _PMMODEL_WAITB_MASK                                 0xC0
#define _PMMODEL_WAITE0_POSN                                0x0
#define _PMMODEL_WAITE0_POSITION                            0x0
#define _PMMODEL_WAITE0_SIZE                                0x1
#define _PMMODEL_WAITE0_LENGTH                              0x1
#define _PMMODEL_WAITE0_MASK                                0x1
#define _PMMODEL_WAITE1_POSN                                0x1
#define _PMMODEL_WAITE1_POSITION                            0x1
#define _PMMODEL_WAITE1_SIZE                                0x1
#define _PMMODEL_WAITE1_LENGTH                              0x1
#define _PMMODEL_WAITE1_MASK                                0x2
#define _PMMODEL_WAITM0_POSN                                0x2
#define _PMMODEL_WAITM0_POSITION                            0x2
#define _PMMODEL_WAITM0_SIZE                                0x1
#define _PMMODEL_WAITM0_LENGTH                              0x1
#define _PMMODEL_WAITM0_MASK                                0x4
#define _PMMODEL_WAITM1_POSN                                0x3
#define _PMMODEL_WAITM1_POSITION                            0x3
#define _PMMODEL_WAITM1_SIZE                                0x1
#define _PMMODEL_WAITM1_LENGTH                              0x1
#define _PMMODEL_WAITM1_MASK                                0x8
#define _PMMODEL_WAITM2_POSN                                0x4
#define _PMMODEL_WAITM2_POSITION                            0x4
#define _PMMODEL_WAITM2_SIZE                                0x1
#define _PMMODEL_WAITM2_LENGTH                              0x1
#define _PMMODEL_WAITM2_MASK                                0x10
#define _PMMODEL_WAITM3_POSN                                0x5
#define _PMMODEL_WAITM3_POSITION                            0x5
#define _PMMODEL_WAITM3_SIZE                                0x1
#define _PMMODEL_WAITM3_LENGTH                              0x1
#define _PMMODEL_WAITM3_MASK                                0x20
#define _PMMODEL_WAITB0_POSN                                0x6
#define _PMMODEL_WAITB0_POSITION                            0x6
#define _PMMODEL_WAITB0_SIZE                                0x1
#define _PMMODEL_WAITB0_LENGTH                              0x1
#define _PMMODEL_WAITB0_MASK                                0x40
#define _PMMODEL_WAITB1_POSN                                0x7
#define _PMMODEL_WAITB1_POSITION                            0x7
#define _PMMODEL_WAITB1_SIZE                                0x1
#define _PMMODEL_WAITB1_LENGTH                              0x1
#define _PMMODEL_WAITB1_MASK                                0x80

// Register: PMMODEH
#define PMMODEH PMMODEH
extern volatile unsigned char           PMMODEH             __at(0xF49);
#ifndef _LIB_BUILD
asm("PMMODEH equ 0F49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :2;
        unsigned MODE16                 :1;
        unsigned INCM                   :2;
        unsigned IRQM                   :2;
        unsigned BUSY                   :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned                        :1;
        unsigned INCM0                  :1;
        unsigned INCM1                  :1;
        unsigned IRQM0                  :1;
        unsigned IRQM1                  :1;
    };
} PMMODEHbits_t;
extern volatile PMMODEHbits_t PMMODEHbits __at(0xF49);
// bitfield macros
#define _PMMODEH_MODE_POSN                                  0x0
#define _PMMODEH_MODE_POSITION                              0x0
#define _PMMODEH_MODE_SIZE                                  0x2
#define _PMMODEH_MODE_LENGTH                                0x2
#define _PMMODEH_MODE_MASK                                  0x3
#define _PMMODEH_MODE16_POSN                                0x2
#define _PMMODEH_MODE16_POSITION                            0x2
#define _PMMODEH_MODE16_SIZE                                0x1
#define _PMMODEH_MODE16_LENGTH                              0x1
#define _PMMODEH_MODE16_MASK                                0x4
#define _PMMODEH_INCM_POSN                                  0x3
#define _PMMODEH_INCM_POSITION                              0x3
#define _PMMODEH_INCM_SIZE                                  0x2
#define _PMMODEH_INCM_LENGTH                                0x2
#define _PMMODEH_INCM_MASK                                  0x18
#define _PMMODEH_IRQM_POSN                                  0x5
#define _PMMODEH_IRQM_POSITION                              0x5
#define _PMMODEH_IRQM_SIZE                                  0x2
#define _PMMODEH_IRQM_LENGTH                                0x2
#define _PMMODEH_IRQM_MASK                                  0x60
#define _PMMODEH_BUSY_POSN                                  0x7
#define _PMMODEH_BUSY_POSITION                              0x7
#define _PMMODEH_BUSY_SIZE                                  0x1
#define _PMMODEH_BUSY_LENGTH                                0x1
#define _PMMODEH_BUSY_MASK                                  0x80
#define _PMMODEH_MODE0_POSN                                 0x0
#define _PMMODEH_MODE0_POSITION                             0x0
#define _PMMODEH_MODE0_SIZE                                 0x1
#define _PMMODEH_MODE0_LENGTH                               0x1
#define _PMMODEH_MODE0_MASK                                 0x1
#define _PMMODEH_MODE1_POSN                                 0x1
#define _PMMODEH_MODE1_POSITION                             0x1
#define _PMMODEH_MODE1_SIZE                                 0x1
#define _PMMODEH_MODE1_LENGTH                               0x1
#define _PMMODEH_MODE1_MASK                                 0x2
#define _PMMODEH_INCM0_POSN                                 0x3
#define _PMMODEH_INCM0_POSITION                             0x3
#define _PMMODEH_INCM0_SIZE                                 0x1
#define _PMMODEH_INCM0_LENGTH                               0x1
#define _PMMODEH_INCM0_MASK                                 0x8
#define _PMMODEH_INCM1_POSN                                 0x4
#define _PMMODEH_INCM1_POSITION                             0x4
#define _PMMODEH_INCM1_SIZE                                 0x1
#define _PMMODEH_INCM1_LENGTH                               0x1
#define _PMMODEH_INCM1_MASK                                 0x10
#define _PMMODEH_IRQM0_POSN                                 0x5
#define _PMMODEH_IRQM0_POSITION                             0x5
#define _PMMODEH_IRQM0_SIZE                                 0x1
#define _PMMODEH_IRQM0_LENGTH                               0x1
#define _PMMODEH_IRQM0_MASK                                 0x20
#define _PMMODEH_IRQM1_POSN                                 0x6
#define _PMMODEH_IRQM1_POSITION                             0x6
#define _PMMODEH_IRQM1_SIZE                                 0x1
#define _PMMODEH_IRQM1_LENGTH                               0x1
#define _PMMODEH_IRQM1_MASK                                 0x40

